---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.EquipmentType
source: html/b4745b25-1b30-1568-d002-82d22b9c129e.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.EquipmentType Property

The type of zone equipment. Note this property would reset other properties.

## Syntax (C#)
```csharp
public ZoneEquipmentHvacType EquipmentType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration